# IFCProperty Set Mapping Info Dispose Method

Source: https://www.revitapidocs.com/2026/4bd2254d-b0ad-8560-fcef-df1b68ad17b8.htm

---

| IFCProperty Set Mapping Info Dispose Method |
| --- |

Releases all resources used by the IFCPropertySetMappingInfo
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void Dispose()
```

```
Public Sub Dispose
```

```
public:
virtual void Dispose() sealed
```

```
abstract Dispose : unit -> unit
override Dispose : unit -> unit
```

#### Implements

IDisposable Dispose
See Also

#### Reference

IFCPropertySetMappingInfo Class Autodesk.Revit.DB Namespace